**free
ctl-opt dftActGrp(*no);
dcl-s count1 int(3) inz(1);
dcl-s count2 int(5) inz(10);
dcl-s count3 int(5) inz(10);
// Main Line starts here
*inlr = *on;
executeSQL();
return;
   
//**********************
dcl-proc executeSQL;
  
  return;
end-proc;
